LEXICON_COMMANDS = {
    '/new': 'Начать новую игру!',
    '/end': 'Завершить',
    '/help': 'Справка.'
}

LEXICON_BTN = {
    '0': '🔲',
    '1': '🔲',
    '2': '🔲',
    '3': '🔲',
    '4': '🔲',
    '5': '🔲',
    '6': '🔲',
    '7': '🔲',
    '8': '🔲',
    'x': '❎',
    'o': '0️⃣'
}

LEXICON = {
    '/start': 'Это игра "Крестики-нолики".\nЧтобы начать новую игру, жми /new.\nЕсли понадобится подсказка, отправляй /help',
    '/new': 'Для подключения к игре второго игрока перешли ему следующее сообщение:\n',
    '/help': 'В игру играют два человека. \nЧтобы начать новую игру, отправь команду /new и отправь полученную ссылку-приглашение второму игроку.\nВторой игрок переходит по ссылке и игра начинается.\nКрестиком играет тот, кто начал игру.\nУдачи!',
    'link': 'Эта ссылка не для тебя!\nПерешли данную ссылку своему сопернику',
    'link_name': 'приглашает тебя сыграть!!!\n\nПерейди по ссылке, чтобы присоединиться к игре:\n',
    'late': 'Приглашение больше не действительно!',
    'busy': 'Уже занято!',
    'your_step':        'ㅤ--==   Твой  ход!   ==--ㅤ',
    'not_your_step':    'ㅤ--== Ход соперника! ==--ㅤ',
    'start_game': 'Игра началась. Первым ходит ',
    'victory':          'ㅤ--==  Ты  победил!  ==--ㅤ',
    'draw': 'Ничья!',
    'loss': 'Ты проиграл!',
    'game_over': 'Игра завершена!\nНажми /new чтобы начать новую игру.',
    'any_msg': 'Для справки используйте /help'
}
